# Taps
tap "homebrew/services"
tap "siderolabs/tap"

# Brews
brew "bat"
brew "stow"
brew "tectonic"
brew "coreutils"
brew "diff-so-fancy"
brew "ncdu"
brew "eza"
brew "findutils"
brew "fx"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "htop"
brew "jq"
brew "mas"
brew "neovim"
brew "ripgrep"
brew "wget"
brew "tldr"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "zsh"
brew "pre-commit"
brew "oh-my-posh"
brew "zoxide"
brew "flux"
brew "talosctl"

# Casks
cask "discord"
cask "beeper"
cask "firefox"
cask "signal"
cask "obsidian"
cask "raycast"
cask "font-jetbrains-mono-nerd-font"
cask "alacritty"
cask "spotify"
cask "vlc"
cask "zoom"
cask "telegram"
cask "aldente"
cask "anki"
cask "tomatobar"
cask "protonvpn"
cask "1password"

# Mac App Store apps

mas "1Password for Safari", id: 1569813296
mas "Hush", id: 1544743900
mas "Xcode", id: 497799835
mas "Baking Soda - Tube Cleaner", id: 1601151613
mas "Vinegar - Tube Cleaner", id: 1591303229
